courses/tech/GoLang/GoLang.org
#+TITLE: Programski jezik Go
#+SUBTITLE: U izradi. Bazirano na Go verziji 1.12.4 i [[https://tour.golang.org/][A Tour of Go]]
#+EXPORT_FILE_NAME: index.html
#+SETUPFILE: ../../courses-startup.org

* Uvod
** Osnovne osobine
   
- Statički tipiziran, kompajliran programski jezik
- Google: Robert Griesemer, Rob Pike, i Ken Thompson
- Sličan C-u ali sa /memory safety/, /garbage collection/ i direktnom podrškom
  za konkurentno programiranje ([[https://en.wikipedia.org/wiki/Communicating_sequential_processes][Communicating Sequential Processes (CSP)]])
- Efikasnost, jednostavnost i čitkost
- Akcenat na mrežnom i /multi-core/ softveru
- Razvoj započet 2007, javno dostupan od 2009

#+attr_html: :class footer :style clear: both;
https://en.wikipedia.org/wiki/Go_(programming_language)

* Instalacija i podešavanja
** Instalacija
   
- Koristiti instaler za OS
- ...ili raspakovati tarball/zip i podesiti =PATH= varijablu na =go/bin= folder
- Na primer:

  #+BEGIN_SRC bash
  wget https://dl.google.com/go/go$VERSION.$OS-$ARCH.tar.gz
  mkdir -p ~/install/go
  tar -C ~/install/go -xzf go$VERSION.$OS-$ARCH.tar.gz
  #+END_SRC
  
- gde je =VERSION= - tekuća verzija (trenutno 1.12.4), =OS= - operativni sistem
  (npr. =linux=) a =ARCH= - arhitektura (npr. =amd64=)
- podesiti =PATH=:

  #+BEGIN_SRC bash
  export PATH=$PATH:~/install/go/
  #+END_SRC
  
** /Workspace/ direktorijum
   
- Direktorijum za Go kod
- Podrazumevano =$HOME/go=
- Ukoliko želite da promenite morate podesiti =GOPATH= varijablu
 
** Testiranje instalacije

  #+BEGIN_SRC bash
  $ go version
  go version go1.12.4 linux/amd64
  #+END_SRC
   
- Napraviti =src/hello= u /workspace/ direktorijumu (dakle =~/go/src/hello=)
- Napraviti fajl =hello.go= sa sadržajem:

  #+BEGIN_SRC go
  package main

  import "fmt"

  func main() {
	  fmt.Printf("Здраво, свете!\n")
  }
  #+END_SRC
  
- Preći u projektni folder, pokrenuti =build= i zatim startovati program:

  #+BEGIN_SRC bash
  $ cd ~/go/src/hello
  $ go build
  $ ./hello
  Здраво, свете!
  #+END_SRC

* Kako pisati Go kod?
** Uvod
   
   Go alati podrazumevaju određene konvencije u organizaciji foldera i
   programskog koda.
   
   Bazirano na [[https://golang.org/doc/code.html][How to Write Go Code]]
   
** /Workspaces/
   
   - Obično se sav Go kod smešta na jedno mesto koje zovemo /workspace/
   - Na ovom mestu se nalazi veći broj repozitorijuma pod sistemima za kontrolu
     verzija (npr. =git=).
   - Svaki repozitorijum se sastoji od jednog ili više paketa
   - Svaki paket se sastoji od jednog ili više Go fajlova u jednom direktorijumu
   - Putanja (/path/) do direktorijuma paketa određuje njegov /import path/

** /Workspaces/
   
  #+BEGIN_SRC
  bin/
      hello                          # command executable
      outyet                         # command executable
  src/
      github.com/golang/example/
          .git/                      # Git repository metadata
    hello/
        hello.go               # command source
    outyet/
        main.go                # command source
        main_test.go           # test source
    stringutil/
        reverse.go             # package source
        reverse_test.go        # test source
      golang.org/x/image/
          .git/                      # Git repository metadata
    bmp/
        reader.go              # package source
        writer.go              # package source
      ... (many more repositories and packages omitted) ...
  #+END_SRC

   
** =GOPATH=

- Podrazumevano =$HOME/go= na Unix-like sistemima ili =%USERPOFILE%\go= na
  Windows-u.
- =go env GOPATH= komanda daje informaciju o tekućoj lokaciji tj. sadržaj
  =GOPATH= varijable ili podrazumevanu lokaciju ukoliko nije podešena.
- Da bi instalirani Go programi bili dostupni:
  #+BEGIN_SRC bash
  $ export PATH=$PATH:$(go env GOPATH)/bin
  #+END_SRC
  
** Import putanja (/import path/)
   
- Kratke putanje za standardnu biblioteku. Na primer: =fmt=, =net/http=
- Putanja je relativna u odnosu na =$GOPATH/src=
- Mora biti jedinstvena
- Dobra praksa je upotreba domena VCS hosting sajtova. Na primer:
  #+BEGIN_SRC
  $GOPATH/src/github.com/user
  #+END_SRC
  
** Prvi Go program
   
   #+BEGIN_SRC shell
   $ mkdir $GOPATH/src/github.com/user/hello
   #+END_SRC
   
   - Fajl =hello.go=
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      fmt.Printf("Здраво, свете!\n")
    }
   #+END_SRC
   
   #+BEGIN_SRC shell
   $ go install github.com/user/hello
   # ili
   $ cd $GOPATH/src/github.com/user/hello
   $ go install
   #+END_SRC
   
   - =hello= program će biti instaliran u =$GOPATH/bin/=

   #+BEGIN_SRC shell
   $ $GOPATH/bin/hello
   Здраво, свете!
   # ili samo
   $ hello
   Здраво, свете!
   #+END_SRC
   
   #+REVEAL: split
   
   - Sledeći korak je da promenu zabeležimo u sistemu za kontrolu verzija:
   #+BEGIN_SRC shell
   $ cd $GOPATH/src/github.com/user/hello
   $ git init
   Initialized empty Git repository in /home/user/work/src/github.com/user/hello/.git/
   $ git add hello.go
   $ git commit -m "initial commit"
   [master (root-commit) 0b4507d] initial commit
   1 file changed, 1 insertion(+)
     create mode 100644 hello.go
   #+END_SRC

