courses/tech/GoLang/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Programski jezik Go</title>
<meta name="author" content="Igor Dejanović"/>
<link rel="stylesheet" href="../../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/css/theme/simple.css" id="theme"/>

<link rel="stylesheet" href="../../reveal-slides.css"/>

<link rel="stylesheet" href="../../highlight-styles/docco.css"/>
<link rel="stylesheet" href=""/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">Programski jezik Go</h1>
<h2 class="subtitle">U izradi. Bazirano na Go verziji 1.12.4 i <a href="https://tour.golang.org/">A Tour of Go</a></h2>
<h2 class="author">Prof. dr Igor Dejanović (<a href="mailto:igord at uns ac rs">igord at uns ac rs</a>)</h2>
<p class="date">Kreirano 2019-05-14 Tue 20:42, pritisni ESC za mapu</p>
</section>

<section>
<section id="slide-orgea06351">
<h2 id="orgea06351">Uvod</h2>
<div class="outline-text-2" id="text-orgea06351">
</div>
</section>
<section id="slide-orge64a10f">
<h3 id="orge64a10f">Osnovne osobine</h3>
<ul>
<li>Statički tipiziran, kompajliran programski jezik</li>
<li>Google: Robert Griesemer, Rob Pike, i Ken Thompson</li>
<li>Sličan C-u ali sa <i>memory safety</i>, <i>garbage collection</i> i direktnom podrškom
za konkurentno programiranje (<a href="https://en.wikipedia.org/wiki/Communicating_sequential_processes">Communicating Sequential Processes (CSP)</a>)</li>
<li>Efikasnost, jednostavnost i čitkost</li>
<li>Akcenat na mrežnom i <i>multi-core</i> softveru</li>
<li>Razvoj započet 2007, javno dostupan od 2009</li>

</ul>

<p class="footer" style="clear: both;">
<a href="https://en.wikipedia.org/wiki/Go_(programming_language)" class="footer" style="clear: both;">https://en.wikipedia.org/wiki/Go_(programming_language)</a>
</p>

</section>
</section>
<section>
<section id="slide-orga835e69">
<h2 id="orga835e69">Instalacija i podešavanja</h2>
<div class="outline-text-2" id="text-orga835e69">
</div>
</section>
<section id="slide-org2e03f1d">
<h3 id="org2e03f1d">Instalacija</h3>
<ul>
<li>Koristiti instaler za OS</li>
<li>&#x2026;ili raspakovati tarball/zip i podesiti <code>PATH</code> varijablu na <code>go/bin</code> folder</li>
<li><p>
Na primer:
</p>

<div class="org-src-container">

<pre><code class=" bash" >wget https://dl.google.com/go/go$VERSION.$OS-$ARCH.tar.gz
mkdir -p ~/install/go
tar -C ~/install/go -xzf go$VERSION.$OS-$ARCH.tar.gz
</code></pre>
</div></li>

<li>gde je <code>VERSION</code> - tekuća verzija (trenutno 1.12.4), <code>OS</code> - operativni sistem
(npr. <code>linux</code>) a <code>ARCH</code> - arhitektura (npr. <code>amd64</code>)</li>
<li><p>
podesiti <code>PATH</code>:
</p>

<div class="org-src-container">

<pre><code class=" bash" >export PATH=$PATH:~/install/go/
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-org618cd8a">
<h3 id="org618cd8a"><i>Workspace</i> direktorijum</h3>
<ul>
<li>Direktorijum za Go kod</li>
<li>Podrazumevano <code>$HOME/go</code></li>
<li>Ukoliko želite da promenite morate podesiti <code>GOPATH</code> varijablu</li>

</ul>

</section>
<section id="slide-org48531ef">
<h3 id="org48531ef">Testiranje instalacije</h3>
<div class="org-src-container">

<pre><code class=" bash" >$ go version
go version go1.12.4 linux/amd64
</code></pre>
</div>

<ul>
<li>Napraviti <code>src/hello</code> u <i>workspace</i> direktorijumu (dakle <code>~/go/src/hello</code>)</li>
<li><p>
Napraviti fajl <code>hello.go</code> sa sadržajem:
</p>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  fmt.Printf("Здраво, свете!\n")
}
</code></pre>
</div></li>

<li><p>
Preći u projektni folder, pokrenuti <code>build</code> i zatim startovati program:
</p>

<div class="org-src-container">

<pre><code class=" bash" >$ cd ~/go/src/hello
$ go build
$ ./hello
Здраво, свете!
</code></pre>
</div></li>

</ul>

</section>
</section>
<section>
<section id="slide-org8440de0">
<h2 id="org8440de0">Kako pisati Go kod?</h2>
<div class="outline-text-2" id="text-org8440de0">
</div>
</section>
<section id="slide-orga8e8be2">
<h3 id="orga8e8be2">Uvod</h3>
<p>
Go alati podrazumevaju određene konvencije u organizaciji foldera i
programskog koda.
</p>

<p>
Bazirano na <a href="https://golang.org/doc/code.html">How to Write Go Code</a>
</p>

</section>
<section id="slide-org8ecb5cb">
<h3 id="org8ecb5cb"><i>Workspaces</i></h3>
<ul>
<li>Obično se sav Go kod smešta na jedno mesto koje zovemo <i>workspace</i></li>
<li>Na ovom mestu se nalazi veći broj repozitorijuma pod sistemima za kontrolu
verzija (npr. <code>git</code>).</li>
<li>Svaki repozitorijum se sastoji od jednog ili više paketa</li>
<li>Svaki paket se sastoji od jednog ili više Go fajlova u jednom direktorijumu</li>
<li>Putanja (<i>path</i>) do direktorijuma paketa određuje njegov <i>import path</i></li>

</ul>

</section>
<section id="slide-orgf3fcdec">
<h3 id="orgf3fcdec"><i>Workspaces</i></h3>
<pre  class="example">
bin/
    hello                          # command executable
    outyet                         # command executable
src/
    github.com/golang/example/
        .git/                      # Git repository metadata
  hello/
      hello.go               # command source
  outyet/
      main.go                # command source
      main_test.go           # test source
  stringutil/
      reverse.go             # package source
      reverse_test.go        # test source
    golang.org/x/image/
        .git/                      # Git repository metadata
  bmp/
      reader.go              # package source
      writer.go              # package source
    ... (many more repositories and packages omitted) ...
</pre>


</section>
<section id="slide-org82ca524">
<h3 id="org82ca524"><code>GOPATH</code></h3>
<ul>
<li>Podrazumevano <code>$HOME/go</code> na Unix-like sistemima ili <code>%USERPOFILE%\go</code> na
Windows-u.</li>
<li><code>go env GOPATH</code> komanda daje informaciju o tekućoj lokaciji tj. sadržaj
<code>GOPATH</code> varijable ili podrazumevanu lokaciju ukoliko nije podešena.</li>
<li><p>
Da bi instalirani Go programi bili dostupni:
</p>
<div class="org-src-container">

<pre><code class=" bash" >$ export PATH=$PATH:$(go env GOPATH)/bin
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-org89fcd9a">
<h3 id="org89fcd9a">Import putanja (<i>import path</i>)</h3>
<ul>
<li>Kratke putanje za standardnu biblioteku. Na primer: <code>fmt</code>, <code>net/http</code></li>
<li>Putanja je relativna u odnosu na <code>$GOPATH/src</code></li>
<li>Mora biti jedinstvena</li>
<li><p>
Dobra praksa je upotreba domena VCS hosting sajtova. Na primer:
</p>
<pre  class="example">
$GOPATH/src/github.com/user
</pre></li>

</ul>

</section>
<section id="slide-org249fe51">
<h3 id="org249fe51">Prvi Go program</h3>
<div class="org-src-container">

<pre><code class=" shell" >$ mkdir $GOPATH/src/github.com/user/hello
</code></pre>
</div>

<ul>
<li>Fajl <code>hello.go</code></li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  fmt.Printf("Здраво, свете!\n")
}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" shell" >$ go install github.com/user/hello
# ili
$ cd $GOPATH/src/github.com/user/hello
$ go install
</code></pre>
</div>

<ul>
<li><code>hello</code> program će biti instaliran u <code>$GOPATH/bin/</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" shell" >$ $GOPATH/bin/hello
Здраво, свете!
# ili samo
$ hello
Здраво, свете!
</code></pre>
</div>

</section>
<section>

<ul>
<li>Sledeći korak je da promenu zabeležimo u sistemu za kontrolu verzija:</li>

</ul>
<div class="org-src-container">

<pre><code class=" shell" >$ cd $GOPATH/src/github.com/user/hello
$ git init
Initialized empty Git repository in /home/user/work/src/github.com/user/hello/.git/
$ git add hello.go
$ git commit -m "initial commit"
[master (root-commit) 0b4507d] initial commit
1 file changed, 1 insertion(+)
  create mode 100644 hello.go
</code></pre>
</div>

</section>
