courses/tech/GoLang/GoLang.org
** Prva Go biblioteka
   
   #+BEGIN_SRC bash
   $ mkdir $GOPATH/src/github.com/user/stringutil
   #+END_SRC
   
   #+BEGIN_SRC go
   // Package stringutil contains utility functions for working with strings.
   package stringutil

   // Reverse returns its argument string reversed rune-wise left to right.
   func Reverse(s string) string {
     r := []rune(s)
     for i, j := 0, len(r)-1; i < len(r)/2; i, j = i+1, j-1 {
       r[i], r[j] = r[j], r[i]
     }
     return string(r)
   }
   #+END_SRC
   
   - Provera ispravnosti biblioteke
   #+BEGIN_SRC shell
   $ go build github.com/user/stringutil
   # ili ako smo već u folderu stringutil
   $ go build
   #+END_SRC
   
   #+REVEAL: split
    
   - Modifikovati program =hello.go=
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"

     "github.com/user/stringutil"
   )

   func main() {
     fmt.Println(stringutil.Reverse("!етевс ,овардЗ"))
   }
   #+END_SRC
   
   #+BEGIN_SRC shell
   $ go install github.com/user/hello
   $ hello
   Здраво, свете!
   #+END_SRC


   #+BEGIN_SRC
   bin/
     hello                 # command executable
   src/
       github.com/user/
           hello/
               hello.go      # command source
           stringutil/
               reverse.go    # package source
   #+END_SRC


   
** Imenovanje paketa
   
   - Prvi iskaz u svakom Go fajlu mora biti:
     #+BEGIN_SRC go
     package name
     #+END_SRC
   - ...gde je =name= ime paketa koje se koristi pri /import/-u
   - Svi fajlovi koji pripadaju istom paketu moraju koristiti isto ime
   - Go konvencija je da je ime paketa poslednji element import putanje. Primer:
     ukoliko se paket importuje sa =crypto/rot13= tada njegovo ime treba da bude
     =rot13=
   - Izvršne komande moraju biti u paketu =main=
   - Ne zahteva se da ime paketa bude jedinstveno kod svih paketa koji se
     importuju ali se zahteva da putanja bude
     
** Promena imena pri /import/-u paketa
   
  #+BEGIN_SRC
  Import declaration          Local name of Sin

  import   "lib/math"         math.Sin
  import m "lib/math"         m.Sin
  import . "lib/math"         Sin
  #+END_SRC
  
  - Import paketa bez upotrebe (zbog /side-effect/-a)
  
  #+BEGIN_SRC
  import _ "lib/math"
  #+END_SRC

  
  #+attr_html: :class footer :style clear: both;
  https://golang.org/ref/spec#Import_declarations

** Testiranje
   
   - /Lightweight/ test okvir u paketu =testing= + =go test= komanda
   - Jedinični test se piše u fajlu koji se završava na =_test.go= i koji sadrži
     funkcije oblika =TestXXX= sa signaturom =func (t *testing.T)=
   - =go test= poziva sve funkcije i ako ona pozove =t.Error= ili =t.Fail= test
     se smatra neuspešnim
     
   #+REVEAL: split

   - Fajl =$GOPATH/src/github.com/user/stringutil/reverse_test.go=
   #+BEGIN_SRC go
   package stringutil

   import "testing"

   func TestReverse(t *testing.T) {
     cases := []struct {
       in, want string
     }{
       {"Hello, world", "dlrow ,olleH"},
       {"Hello, 世界", "界世 ,olleH"},
       {"", ""},
     }
     for _, c := range cases {
       got := Reverse(c.in)
       if got != c.want {
         t.Errorf("Reverse(%q) == %q, want %q", c.in, got, c.want)
       }
     }
   }
   #+END_SRC
   
   #+BEGIN_SRC shell
   $ go test github.com/user/stringutil
   ok  	github.com/user/stringutil 0.165s
   # ili samo
   $ go test
   ok  	github.com/user/stringutil 0.165s
   #+END_SRC
   
** Udaljeni paketi (/Remote packages/)
   
   - Import putanja može biti u obliku URL-a do repozitorijuma za kontrolu
     verzija (npr. Git ili Mercurial)
   - =go get= alat će preuzeti kod iz udaljenog repozitorijuma ako nije dostupan
     u lokalnom radnom prostoru (/workspace/)
   - Zavisni paketi dostupni preko udaljenih repozitorijuma se takođe automatski
     preuzimaju
   - Za više informacija videti =go help importpath=

* Go Tour
  
  Interaktivno učenje Go jezika:
  
  - https://tour.golang.org/
  - https://github.com/golang/tour

  Pokretanje lokalno:

  #+BEGIN_SRC
  $ go get golang.org/x/tour
  $ tour
  #+END_SRC

* Paketi, varijable, funkcije
** Paketi
   
   - Svaki Go program se sastoji od paketa
   - Program počinje izvršavanje u paketu =main= i funkciji =func main()=
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math/rand"
   )

   func main() {
     fmt.Println("My favorite number is", rand.Intn(10))
   }
   #+END_SRC
   
   - Paket se referencira po poslednjoj komponenti import putanje (u prethodnom
     primeru =rand=).
     
** =Import= iskaz
   
   - Navođenje paketa koji se koriste u posmatranom fajlu
   - Može se navesti više paketa unutar zagrada (tzv. /factored import/)
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func main() {
     fmt.Printf("Now you have %g problems.\n", math.Sqrt(7))
   }
   #+END_SRC
   
** Eksportovana imena
   
   Ime je eksportovano iz paketa (odnosno može se importovati u drugim paketima)
   ako počinje velikim slovom.
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func main() {
     fmt.Println(math.pi)  // <-- treba math.Pi
   }
   #+END_SRC
   
   Imenima koji počinju malim slovom ne može se pristupiti izvan paketa u kome
   su definisani.

** Funkcije

   - Funkcije mogu imati nula ili više argumenata
   #+BEGIN_SRC go
   package main

   import "fmt"

   func add(x int, y int) int {
     return x + y
   }

   func main() {
     fmt.Println(add(42, 13))
   }
   #+END_SRC
   
   - Ili kraće
   #+BEGIN_SRC go
   package main

   import "fmt"

   func add(x, y int) int {
     return x + y
   }

   func main() {
     fmt.Println(add(42, 13))
   }
   #+END_SRC


   

** Višestruke povratne vrednosti
   
   - Funkcije mogu vratiti proizvoljan broj rezultata
   #+BEGIN_SRC go
   package main

   import "fmt"

   func swap(x, y string) (string, string) {
     return y, x
   }

   func main() {
     a, b := swap("hello", "world")
     fmt.Println(a, b)
   }
   #+END_SRC

** Imenovane povratne vrednosti
  
   - Povratne vrednosti mogu biti imenovane i u tom slučaju može se koristiti
     =return= iskaz bez argumenata (tzv. /naked return/)
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func split(sum int) (x, y int) {
     x = sum * 4 / 9
     y = sum - x
     return
   }

   func main() {
     fmt.Println(split(17))
   }
   #+END_SRC

** Varijable
   
   - =var= iskaz definiše varijable. Tip se navodi na kraju
   - =var= iskaz se može koristiti na nivou paketa ili funkcije
 
   #+BEGIN_SRC go
   package main

   import "fmt"

   var c, python, java bool

   func main() {
     var i int
     fmt.Println(i, c, python, java)
   }
   #+END_SRC

