courses/tech/GoLang/index.html
<section id="slide-orge1975b1">
<h3 id="orge1975b1">Prva Go biblioteka</h3>
<div class="org-src-container">

<pre><code class=" bash" >$ mkdir $GOPATH/src/github.com/user/stringutil
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" go" >// Package stringutil contains utility functions for working with strings.
package stringutil

// Reverse returns its argument string reversed rune-wise left to right.
func Reverse(s string) string {
  r := []rune(s)
  for i, j := 0, len(r)-1; i &lt; len(r)/2; i, j = i+1, j-1 {
    r[i], r[j] = r[j], r[i]
  }
  return string(r)
}
</code></pre>
</div>

<ul>
<li>Provera ispravnosti biblioteke</li>

</ul>
<div class="org-src-container">

<pre><code class=" shell" >$ go build github.com/user/stringutil
# ili ako smo već u folderu stringutil
$ go build
</code></pre>
</div>

</section>
<section>

<ul>
<li>Modifikovati program <code>hello.go</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"

  "github.com/user/stringutil"
)

func main() {
  fmt.Println(stringutil.Reverse("!етевс ,овардЗ"))
}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" shell" >$ go install github.com/user/hello
$ hello
Здраво, свете!
</code></pre>
</div>


<pre  class="example">
bin/
  hello                 # command executable
src/
    github.com/user/
        hello/
            hello.go      # command source
        stringutil/
            reverse.go    # package source
</pre>



</section>
<section id="slide-orgf4bb8bb">
<h3 id="orgf4bb8bb">Imenovanje paketa</h3>
<ul>
<li><p>
Prvi iskaz u svakom Go fajlu mora biti:
</p>
<div class="org-src-container">

<pre><code class=" go" >package name
</code></pre>
</div></li>
<li>&#x2026;gde je <code>name</code> ime paketa koje se koristi pri <i>import</i>-u</li>
<li>Svi fajlovi koji pripadaju istom paketu moraju koristiti isto ime</li>
<li>Go konvencija je da je ime paketa poslednji element import putanje. Primer:
ukoliko se paket importuje sa <code>crypto/rot13</code> tada njegovo ime treba da bude
<code>rot13</code></li>
<li>Izvršne komande moraju biti u paketu <code>main</code></li>
<li>Ne zahteva se da ime paketa bude jedinstveno kod svih paketa koji se
importuju ali se zahteva da putanja bude</li>

</ul>

</section>
<section id="slide-orgdabbee6">
<h3 id="orgdabbee6">Promena imena pri <i>import</i>-u paketa</h3>
<pre  class="example">
Import declaration          Local name of Sin

import   "lib/math"         math.Sin
import m "lib/math"         m.Sin
import . "lib/math"         Sin
</pre>

<ul>
<li>Import paketa bez upotrebe (zbog <i>side-effect</i>-a)</li>

</ul>

<pre  class="example">
import _ "lib/math"
</pre>


<p class="footer" style="clear: both;">
<a href="https://golang.org/ref/spec#Import_declarations" class="footer" style="clear: both;">https://golang.org/ref/spec#Import_declarations</a>
</p>

</section>
<section id="slide-orgd3ff81b">
<h3 id="orgd3ff81b">Testiranje</h3>
<ul>
<li><i>Lightweight</i> test okvir u paketu <code>testing</code> + <code>go test</code> komanda</li>
<li>Jedinični test se piše u fajlu koji se završava na <code>_test.go</code> i koji sadrži
funkcije oblika <code>TestXXX</code> sa signaturom <code>func (t *testing.T)</code></li>
<li><code>go test</code> poziva sve funkcije i ako ona pozove <code>t.Error</code> ili <code>t.Fail</code> test
se smatra neuspešnim</li>

</ul>

</section>
<section>

<ul>
<li>Fajl <code>$GOPATH/src/github.com/user/stringutil/reverse_test.go</code></li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package stringutil

import "testing"

func TestReverse(t *testing.T) {
  cases := []struct {
    in, want string
  }{
    {"Hello, world", "dlrow ,olleH"},
    {"Hello, 世界", "界世 ,olleH"},
    {"", ""},
  }
  for _, c := range cases {
    got := Reverse(c.in)
    if got != c.want {
      t.Errorf("Reverse(%q) == %q, want %q", c.in, got, c.want)
    }
  }
}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" shell" >$ go test github.com/user/stringutil
ok  	github.com/user/stringutil 0.165s
# ili samo
$ go test
ok  	github.com/user/stringutil 0.165s
</code></pre>
</div>

</section>
<section id="slide-orgd8ec295">
<h3 id="orgd8ec295">Udaljeni paketi (<i>Remote packages</i>)</h3>
<ul>
<li>Import putanja može biti u obliku URL-a do repozitorijuma za kontrolu
verzija (npr. Git ili Mercurial)</li>
<li><code>go get</code> alat će preuzeti kod iz udaljenog repozitorijuma ako nije dostupan
u lokalnom radnom prostoru (<i>workspace</i>)</li>
<li>Zavisni paketi dostupni preko udaljenih repozitorijuma se takođe automatski
preuzimaju</li>
<li>Za više informacija videti <code>go help importpath</code></li>

</ul>

</section>
</section>
<section>
<section id="slide-org5322197">
<h2 id="org5322197">Go Tour</h2>
<p>
Interaktivno učenje Go jezika:
</p>

<ul>
<li><a href="https://tour.golang.org/">https://tour.golang.org/</a></li>
<li><a href="https://github.com/golang/tour">https://github.com/golang/tour</a></li>

</ul>

<p>
Pokretanje lokalno:
</p>

<pre  class="example">
$ go get golang.org/x/tour
$ tour
</pre>

</section>
</section>
<section>
<section id="slide-org28f3696">
<h2 id="org28f3696">Paketi, varijable, funkcije</h2>
<div class="outline-text-2" id="text-org28f3696">
</div>
</section>
<section id="slide-orge0fb40a">
<h3 id="orge0fb40a">Paketi</h3>
<ul>
<li>Svaki Go program se sastoji od paketa</li>
<li>Program počinje izvršavanje u paketu <code>main</code> i funkciji <code>func main()</code></li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math/rand"
)

func main() {
  fmt.Println("My favorite number is", rand.Intn(10))
}
</code></pre>
</div>

<ul>
<li>Paket se referencira po poslednjoj komponenti import putanje (u prethodnom
primeru <code>rand</code>).</li>

</ul>

</section>
<section id="slide-org05dbd6c">
<h3 id="org05dbd6c"><code>Import</code> iskaz</h3>
<ul>
<li>Navođenje paketa koji se koriste u posmatranom fajlu</li>
<li>Može se navesti više paketa unutar zagrada (tzv. <i>factored import</i>)</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func main() {
  fmt.Printf("Now you have %g problems.\n", math.Sqrt(7))
}
</code></pre>
</div>

</section>
<section id="slide-org0b37f3d">
<h3 id="org0b37f3d">Eksportovana imena</h3>
<p>
Ime je eksportovano iz paketa (odnosno može se importovati u drugim paketima)
ako počinje velikim slovom.
</p>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func main() {
  fmt.Println(math.pi)  // &lt;-- treba math.Pi
}
</code></pre>
</div>

<p>
Imenima koji počinju malim slovom ne može se pristupiti izvan paketa u kome
su definisani.
</p>

</section>
<section id="slide-org4699ca4">
<h3 id="org4699ca4">Funkcije</h3>
<ul>
<li>Funkcije mogu imati nula ili više argumenata</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func add(x int, y int) int {
  return x + y
}

func main() {
  fmt.Println(add(42, 13))
}
</code></pre>
</div>

<ul>
<li>Ili kraće</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func add(x, y int) int {
  return x + y
}

func main() {
  fmt.Println(add(42, 13))
}
</code></pre>
</div>




</section>
<section id="slide-org586b939">
<h3 id="org586b939">Višestruke povratne vrednosti</h3>
<ul>
<li>Funkcije mogu vratiti proizvoljan broj rezultata</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func swap(x, y string) (string, string) {
  return y, x
}

func main() {
  a, b := swap("hello", "world")
  fmt.Println(a, b)
}
</code></pre>
</div>

</section>
<section id="slide-orge3fb2ab">
<h3 id="orge3fb2ab">Imenovane povratne vrednosti</h3>
<ul>
<li>Povratne vrednosti mogu biti imenovane i u tom slučaju može se koristiti
<code>return</code> iskaz bez argumenata (tzv. <i>naked return</i>)</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func split(sum int) (x, y int) {
  x = sum * 4 / 9
  y = sum - x
  return
}

func main() {
  fmt.Println(split(17))
}
</code></pre>
</div>

</section>
<section id="slide-org08797f3">
<h3 id="org08797f3">Varijable</h3>
<ul>
<li><code>var</code> iskaz definiše varijable. Tip se navodi na kraju</li>
<li><code>var</code> iskaz se može koristiti na nivou paketa ili funkcije</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

var c, python, java bool

func main() {
  var i int
  fmt.Println(i, c, python, java)
}
</code></pre>
</div>

</section>
