courses/tech/GoLang/GoLang.org
** Varijable sa inicijalizatorima
   
   - =var= iskaz može imati inicijalizatore, jedan po varijabli
   - Ako se koristi inicijalizator, tip može da se izostavi jer može da se
     odredi na osnovu inicijalizatora
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   var i, j int = 1, 2

   func main() {
     var c, python, java = true, false, "no!"
     fmt.Println(i, j, c, python, java)
   }
   #+END_SRC

** Kratka deklaracija varijabli
   
   - Unutar funkcija, kraći oblik deklaracije baziran na ~:=~ dodeli može da se
     koristi
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     var i, j int = 1, 2
     k := 3
     c, python, java := true, false, "no!"

     fmt.Println(i, j, k, c, python, java)
   }
   #+END_SRC

   - Ovo nije moguće koristiti van funkcije jer svaki iskaz mora početi sa
     ključnom rečju

** Osnovni tipovi
   
   - Osnovni tipovi u Go-u su:

   #+BEGIN_SRC
   bool

   string

   int  int8  int16  int32  int64
   uint uint8 uint16 uint32 uint64 uintptr

   byte // alias for uint8

   rune // alias for int32
        // represents a Unicode code point

   float32 float64

   complex64 complex128
   #+END_SRC
   
   #+REVEAL: split

   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math/cmplx"
   )

   var (
     ToBe   bool       = false
     MaxInt uint64     = 1<<64 - 1
     z      complex128 = cmplx.Sqrt(-5 + 12i)
   )

   func main() {
     fmt.Printf("Type: %T Value: %v\n", ToBe, ToBe)
     fmt.Printf("Type: %T Value: %v\n", MaxInt, MaxInt)
     fmt.Printf("Type: %T Value: %v\n", z, z)
   }
   #+END_SRC
   
   #+BEGIN_SRC
   Type: bool Value: false
   Type: uint64 Value: 18446744073709551615
   Type: complex128 Value: (2+3i)
   #+END_SRC

** Nulte vrednosti
   
   - Varijable deklarisane bez inicijalizatora se inicijalizuju na podrazumevane
     nulte vrednosti:
     - =0= za numeričke tipove
     - =false= za =boolean= tip
     - =""= (prazan string) za =string= tip
 
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     var i int
     var f float64
     var b bool
     var s string
     fmt.Printf("%v %v %v %q\n", i, f, b, s)
   }
   #+END_SRC
   
   #+BEGIN_SRC
   0 0 false ""
   #+END_SRC

** Konverzija tipova
   
   - Izraz oblika =T(v)= konvertuje vrednost =v= u tip =T=
   - Na primer:
   #+BEGIN_SRC go
   var i int = 42
   var f float64 = float64(i)
   var u uint = uint(f)
   #+END_SRC
   
   - ... ili jednostavnije:
   #+BEGIN_SRC go
   i := 42
   f := float64(i)
   u := uint(f)
   #+END_SRC
   
   - Za razliku od C-a u Go-u dodela između različitih tipova zahteva
     eksplicitnu konverziju
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func main() {
     var x, y int = 3, 4
     var f float64 = math.Sqrt(float64(x*x + y*y))
     var z uint = uint(f)
     fmt.Println(x, y, z)
   }
   #+END_SRC

** Inferencija tipova (/Type inference/)
   
   - Kada je desna strana iskaza dodele (bilo ~:=~ bilo  ~var =~) tipizirana,
     leva strana će biti istog tipa
     
   #+BEGIN_SRC go
   var i int
   j := i // j is an int
   #+END_SRC
   
   - Ali ako je na desnoj strani netipizirana numerička konstanta, tip zavisi od
     preciznosti konstante:

   #+BEGIN_SRC go
   i := 42           // int
   f := 3.142        // float64
   g := 0.867 + 0.5i // complex128
   #+END_SRC

** Konstante
   
   - Deklarisane kao varijable ali upotrebom ključne reči =const=
   - Mogu biti osnovnih tipova
   - Ne mogu se definisati upotrebom ~:=~
   
   #+BEGIN_SRC go
   package main

   import "fmt"

   const Pi = 3.14

   func main() {
     const World = "世界"
     fmt.Println("Hello", World)
     fmt.Println("Happy", Pi, "Day")

     const Truth = true
     fmt.Println("Go rules?", Truth)
   }
   #+END_SRC
   
** Numeričke konstante

   - Vrednosti proizvoljne preciznosti (/arbitrary-precision/)
   - Kod netipiziranih konstanti tip se određuje na osnovu konteksta
   #+BEGIN_SRC go
   package main

   import "fmt"

   const (
     // Create a huge number by shifting a 1 bit left 100 places.
     // In other words, the binary number that is 1 followed by 100 zeroes.
     Big = 1 << 100
     // Shift it right again 99 places, so we end up with 1<<1, or 2.
     Small = Big >> 99
   )

   func needInt(x int) int { return x*10 + 1 }
   func needFloat(x float64) float64 {
     return x * 0.1
   }

   func main() {
     fmt.Println(needInt(Small))
     fmt.Println(needFloat(Small))
     fmt.Println(needFloat(Big))
     fmt.Println(needInt(Big))  // <-- constant overflow
   }
   #+END_SRC
   
   #+REVEAL: split
   
   #+BEGIN_SRC go
   const Huge = 1e1000
   
   # Sledeća linija ne može da se kompajlira
   # Greška je 'constant 1.00000e+1000 overflows float64'
   fmt.Println(Huge)
   
   # Ali ovo radi bez problema jer se kalkulacija obavlja od strane kompajlera
   # u vreme kompajliranja
   fmt.Println(Huge / 1e999)
   #+END_SRC
   
   #+attr_html: :class footer :style clear: both;
   https://blog.golang.org/constants
   
** Enumerisane konstante (=iota=)

   - Kada nam je potrebna enumeracija
   
   #+BEGIN_SRC go
   const (
       CategoryBooks = iota // 0
       CategoryHealth       // 1
       CategoryClothing     // 2
   )
   #+END_SRC
   
   - ili u kombinaciji sa tipom (da bi kompajler mogao da spreči greške sa
     tipovima)
     
   #+BEGIN_SRC go
   type Stereotype int

   const (
       TypicalNoob Stereotype = iota // 0
       TypicalHipster                // 1
       TypicalUnixWizard             // 2
       TypicalStartupFounder         // 3
   )
   #+END_SRC
   
   #+attr_html: :class footer :style clear: both;
   https://splice.com/blog/iota-elegant-constants-golang/

   
   #+REVEAL: split
   
   - Ako želimo da preskočimo vrednosti
   
   #+BEGIN_SRC go
   type AudioOutput int

   const (
       OutMute AudioOutput = iota // 0
       OutMono                    // 1
       OutStereo                  // 2
       _
       _
       OutSurround                // 5
   )
   #+END_SRC
   
   - Možemo kreirati i izraze sa =iota=
   
   #+BEGIN_SRC go
   type Allergen int

   const (
       IgEggs Allergen = 1 << iota // 1 << 0 which is 00000001
       IgChocolate                 // 1 << 1 which is 00000010
       IgNuts                      // 1 << 2 which is 00000100
       IgStrawberries              // 1 << 3 which is 00001000
       IgShellfish                 // 1 << 4 which is 00010000
   )
   #+END_SRC


   
   


   #+attr_html: :class footer :style clear: both;
   https://splice.com/blog/iota-elegant-constants-golang/

* Iskazi kontrole toka: =for=, =if=, =else=, =switch= i =defer=
