courses/tech/GoLang/index.html
<section id="slide-orgcdd78dc">
<h3 id="orgcdd78dc">Varijable sa inicijalizatorima</h3>
<ul>
<li><code>var</code> iskaz može imati inicijalizatore, jedan po varijabli</li>
<li>Ako se koristi inicijalizator, tip može da se izostavi jer može da se
odredi na osnovu inicijalizatora</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

var i, j int = 1, 2

func main() {
  var c, python, java = true, false, "no!"
  fmt.Println(i, j, c, python, java)
}
</code></pre>
</div>

</section>
<section id="slide-org5b19593">
<h3 id="org5b19593">Kratka deklaracija varijabli</h3>
<ul>
<li>Unutar funkcija, kraći oblik deklaracije baziran na <code>:=</code> dodeli može da se
koristi</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  var i, j int = 1, 2
  k := 3
  c, python, java := true, false, "no!"

  fmt.Println(i, j, k, c, python, java)
}
</code></pre>
</div>

<ul>
<li>Ovo nije moguće koristiti van funkcije jer svaki iskaz mora početi sa
ključnom rečju</li>

</ul>

</section>
<section id="slide-org035a4e9">
<h3 id="org035a4e9">Osnovni tipovi</h3>
<ul>
<li>Osnovni tipovi u Go-u su:</li>

</ul>

<pre  class="example">
bool

string

int  int8  int16  int32  int64
uint uint8 uint16 uint32 uint64 uintptr

byte // alias for uint8

rune // alias for int32
     // represents a Unicode code point

float32 float64

complex64 complex128
</pre>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math/cmplx"
)

var (
  ToBe   bool       = false
  MaxInt uint64     = 1&lt;&lt;64 - 1
  z      complex128 = cmplx.Sqrt(-5 + 12i)
)

func main() {
  fmt.Printf("Type: %T Value: %v\n", ToBe, ToBe)
  fmt.Printf("Type: %T Value: %v\n", MaxInt, MaxInt)
  fmt.Printf("Type: %T Value: %v\n", z, z)
}
</code></pre>
</div>

<pre  class="example">
Type: bool Value: false
Type: uint64 Value: 18446744073709551615
Type: complex128 Value: (2+3i)
</pre>

</section>
<section id="slide-orgcf6b487">
<h3 id="orgcf6b487">Nulte vrednosti</h3>
<ul>
<li>Varijable deklarisane bez inicijalizatora se inicijalizuju na podrazumevane
nulte vrednosti:
<ul>
<li><code>0</code> za numeričke tipove</li>
<li><code>false</code> za <code>boolean</code> tip</li>
<li><code>""</code> (prazan string) za <code>string</code> tip</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  var i int
  var f float64
  var b bool
  var s string
  fmt.Printf("%v %v %v %q\n", i, f, b, s)
}
</code></pre>
</div>

<pre  class="example">
0 0 false ""
</pre>

</section>
<section id="slide-org7ff2932">
<h3 id="org7ff2932">Konverzija tipova</h3>
<ul>
<li>Izraz oblika <code>T(v)</code> konvertuje vrednost <code>v</code> u tip <code>T</code></li>
<li>Na primer:</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >var i int = 42
var f float64 = float64(i)
var u uint = uint(f)
</code></pre>
</div>

<ul>
<li>&#x2026; ili jednostavnije:</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >i := 42
f := float64(i)
u := uint(f)
</code></pre>
</div>

<ul>
<li>Za razliku od C-a u Go-u dodela između različitih tipova zahteva
eksplicitnu konverziju</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func main() {
  var x, y int = 3, 4
  var f float64 = math.Sqrt(float64(x*x + y*y))
  var z uint = uint(f)
  fmt.Println(x, y, z)
}
</code></pre>
</div>

</section>
<section id="slide-orgb450bad">
<h3 id="orgb450bad">Inferencija tipova (<i>Type inference</i>)</h3>
<ul>
<li>Kada je desna strana iskaza dodele (bilo <code>:=</code> bilo  <code>var =</code>) tipizirana,
leva strana će biti istog tipa</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >var i int
j := i // j is an int
</code></pre>
</div>

<ul>
<li>Ali ako je na desnoj strani netipizirana numerička konstanta, tip zavisi od
preciznosti konstante:</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >i := 42           // int
f := 3.142        // float64
g := 0.867 + 0.5i // complex128
</code></pre>
</div>

</section>
<section id="slide-org02ce787">
<h3 id="org02ce787">Konstante</h3>
<ul>
<li>Deklarisane kao varijable ali upotrebom ključne reči <code>const</code></li>
<li>Mogu biti osnovnih tipova</li>
<li>Ne mogu se definisati upotrebom <code>:=</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

const Pi = 3.14

func main() {
  const World = "世界"
  fmt.Println("Hello", World)
  fmt.Println("Happy", Pi, "Day")

  const Truth = true
  fmt.Println("Go rules?", Truth)
}
</code></pre>
</div>

</section>
<section id="slide-org802955a">
<h3 id="org802955a">Numeričke konstante</h3>
<ul>
<li>Vrednosti proizvoljne preciznosti (<i>arbitrary-precision</i>)</li>
<li>Kod netipiziranih konstanti tip se određuje na osnovu konteksta</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

const (
  // Create a huge number by shifting a 1 bit left 100 places.
  // In other words, the binary number that is 1 followed by 100 zeroes.
  Big = 1 &lt;&lt; 100
  // Shift it right again 99 places, so we end up with 1&lt;&lt;1, or 2.
  Small = Big &gt;&gt; 99
)

func needInt(x int) int { return x*10 + 1 }
func needFloat(x float64) float64 {
  return x * 0.1
}

func main() {
  fmt.Println(needInt(Small))
  fmt.Println(needFloat(Small))
  fmt.Println(needFloat(Big))
  fmt.Println(needInt(Big))  // &lt;-- constant overflow
}
</code></pre>
</div>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >const Huge = 1e1000

# Sledeća linija ne može da se kompajlira
# Greška je 'constant 1.00000e+1000 overflows float64'
fmt.Println(Huge)

# Ali ovo radi bez problema jer se kalkulacija obavlja od strane kompajlera
# u vreme kompajliranja
fmt.Println(Huge / 1e999)
</code></pre>
</div>

<p class="footer" style="clear: both;">
<a href="https://blog.golang.org/constants" class="footer" style="clear: both;">https://blog.golang.org/constants</a>
</p>

</section>
<section id="slide-orgdc54622">
<h3 id="orgdc54622">Enumerisane konstante (<code>iota</code>)</h3>
<ul>
<li>Kada nam je potrebna enumeracija</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >const (
    CategoryBooks = iota // 0
    CategoryHealth       // 1
    CategoryClothing     // 2
)
</code></pre>
</div>

<ul>
<li>ili u kombinaciji sa tipom (da bi kompajler mogao da spreči greške sa
tipovima)</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >type Stereotype int

const (
    TypicalNoob Stereotype = iota // 0
    TypicalHipster                // 1
    TypicalUnixWizard             // 2
    TypicalStartupFounder         // 3
)
</code></pre>
</div>

<p class="footer" style="clear: both;">
<a href="https://splice.com/blog/iota-elegant-constants-golang/" class="footer" style="clear: both;">https://splice.com/blog/iota-elegant-constants-golang/</a>
</p>


</section>
<section>

<ul>
<li>Ako želimo da preskočimo vrednosti</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >type AudioOutput int

const (
    OutMute AudioOutput = iota // 0
    OutMono                    // 1
    OutStereo                  // 2
    _
    _
    OutSurround                // 5
)
</code></pre>
</div>

<ul>
<li>Možemo kreirati i izraze sa <code>iota</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >type Allergen int

const (
    IgEggs Allergen = 1 &lt;&lt; iota // 1 &lt;&lt; 0 which is 00000001
    IgChocolate                 // 1 &lt;&lt; 1 which is 00000010
    IgNuts                      // 1 &lt;&lt; 2 which is 00000100
    IgStrawberries              // 1 &lt;&lt; 3 which is 00001000
    IgShellfish                 // 1 &lt;&lt; 4 which is 00010000
)
</code></pre>
</div>






<p class="footer" style="clear: both;">
<a href="https://splice.com/blog/iota-elegant-constants-golang/" class="footer" style="clear: both;">https://splice.com/blog/iota-elegant-constants-golang/</a>
</p>

</section>
</section>
<section>
<section id="slide-org7a6fea5">
<h2 id="org7a6fea5">Iskazi kontrole toka: <code>for</code>, <code>if</code>, <code>else</code>, <code>switch</code> i <code>defer</code></h2>
<div class="outline-text-2" id="text-org7a6fea5">
</div>
</section>
