courses/tech/GoLang/GoLang.org
** =For= iskaz
   
   - Go ima samo jedan iskaz za petlje -- =for=
   - Tri komponente:
     - /init iskaz/ -- izvršava se pre prve iteracije
     - /uslov/ -- evaluira se pre svake iteracije i u zavisnosti od rezultata
       ciklus se izvršava ili se petlja prekida
     - /post iskaz/ -- izvršava se na kraju svake iteracije
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     sum := 0
     for i := 0; i < 10; i++ {
       sum += i
     }
     fmt.Println(sum)
   }
   #+END_SRC
   
   - Zagrade =()= se ne navode kao u nekim drugim jezicima ali je navođenje ={}=
     za telo petlje obavezno
   - Varijable kreirane u /init/ iskazu su dostupne samo unutar petlje
     
   #+REVEAL: split

   - /init/ i /post/ iskazi su opcioni
   
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     sum := 1
     for ; sum < 1000; {
       sum += sum
     }
     fmt.Println(sum)
   }
   #+END_SRC
   
** =for= je =while= u Go-u
   
   - Kada nemamo /init/ i /post/ iskaz možemo izostaviti =;= i dobijamo
     ekvivalent =while= petlje u drugim jezicima
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     sum := 1
     for sum < 1000 {
       sum += sum
     }
     fmt.Println(sum)
   }
   #+END_SRC
   
** "Beskonačna" petlja
   
   - Ako se izostavi i uslov dobijamo beskonačnu petlju
   
   #+BEGIN_SRC go
   package main

   func main() {
     for {
     }
   }
   #+END_SRC
   
** Uslovi -- =if= iskaz

   - Kao i kod =for= i kod =if= iskaza zagrade nije potrebno navoditi
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func sqrt(x float64) string {
     if x < 0 {
       return sqrt(-x) + "i"
     }
     return fmt.Sprint(math.Sqrt(x))
   }

   func main() {
     fmt.Println(sqrt(2), sqrt(-4))
   }
   #+END_SRC

** =if= sa kratkim iskazom
   
   - Kao i =for= i =if= može da ima kratak iskaz (najčešće ~:=~) koji se
     izvršava pre uslova
   - Varijable deklarisane u ovom iskazu su dostupne samo unutar =if= iskaza
 
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func pow(x, n, lim float64) float64 {
     if v := math.Pow(x, n); v < lim {
       return v
     }
     return lim
   }

   func main() {
     fmt.Println(
       pow(3, 2, 10),
       pow(3, 3, 20),
     )
   }
   #+END_SRC

** =if= i =else=
   
   - Varijable deklarisane u =if= kratkom iskazu su dostupne i u opcionom =else=
     bloku
     
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "math"
   )

   func pow(x, n, lim float64) float64 {
     if v := math.Pow(x, n); v < lim {
       return v
     } else {
       fmt.Printf("%g >= %g\n", v, lim)
     }
     // can't use v here, though
     return lim
   }

   func main() {
     fmt.Println(
       pow(3, 2, 10),
       pow(3, 3, 20),
     )
   }
   #+END_SRC
   
   #+BEGIN_SRC
   27 >= 20
   9 20
   #+END_SRC

** =switch= iskaz
   
   - Kraći način pisanja sekvence =if/else= iskaza. Izvršava prvi =case= blok
     gde je vrednost jednaka vrednošću izraza uslova
   - Može imati kratak iskaz kao i =if=
 
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "runtime"
   )

   func main() {
     fmt.Print("Go runs on ")
     switch os := runtime.GOOS; os {
     case "darwin":
       fmt.Println("OS X.")
     case "linux":
       fmt.Println("Linux.")
     default:
       // freebsd, openbsd,
       // plan9, windows...
       fmt.Printf("%s.\n", os)
     }
   }
   #+END_SRC
   
   - Za razliku od drugih jezika izvršava se samo jedan =case= blok (nema
     "propadanja"). Takođe =case= prihvata izraz koji ne mora biti konstanta i
     čija vrenost ne mora biti numerička

** Evaluacija =switch= iskaza
   
   - Evaluacija =case= blokova ide od vrha prema dnu dok se ne nađe prvi blok
     čija vrednost je jednaka zadatom uslovu
   
   - =f()= se ne poziva ako je ~i==0~

   #+BEGIN_SRC go
    switch i {
    case 0:
    case f():
    }
   #+END_SRC
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "time"
   )

   func main() {
     fmt.Println("When's Saturday?")
     today := time.Now().Weekday()
     switch time.Saturday {
     case today + 0:
       fmt.Println("Today.")
     case today + 1:
       fmt.Println("Tomorrow.")
     case today + 2:
       fmt.Println("In two days.")
     default:
       fmt.Println("Too far away.")
     }
   }
   #+END_SRC

** =switch= bez uslova
   
   - Ekvivalentno sa =switch true=
   - Ćistiji način pisanja dugih if-then-else lanaca
   
   #+BEGIN_SRC go
   package main

   import (
     "fmt"
     "time"
   )

   func main() {
     t := time.Now()
     switch {
     case t.Hour() < 12:
       fmt.Println("Good morning!")
     case t.Hour() < 17:
       fmt.Println("Good afternoon.")
     default:
       fmt.Println("Good evening.")
     }
   }
   #+END_SRC

** =defer= iskaz
   
   - Odlaže izvršavanje funkcije dok se ne vratimo iz funkcije u kojoj se
     nalazimo
   - Parametri funkcije se evaluiraju na mestu poziva =defer= ali se ciljna
     funkcija ne poziva do povratka
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     defer fmt.Println("world")

     fmt.Println("hello")
   }
   #+END_SRC
   
   #+BEGIN_SRC
   hello
   world
   #+END_SRC

** Stekovanje =defer= poziva
   
   - =defer= pozivi se smeštaju na stek i po povratku funcije se izvršavaju u
     LIFO redosledu
     
   #+BEGIN_SRC go
   package main

   import "fmt"

   func main() {
     fmt.Println("counting")

     for i := 0; i < 10; i++ {
       defer fmt.Println(i)
     }

     fmt.Println("done")
   }
   #+END_SRC
   
   #+BEGIN_SRC
   counting
   done
   9
   8
   ...
   #+END_SRC

   - Više detalja možete naći u [[https://blog.golang.org/defer-panic-and-recover][ovom blog post-u]]

* =struct=, =slice= i =map=
** Pokazivači (=Pointers=)
   
   - Memorijska adresa vrednosti varijable
   - =*T= je pokazivač na vrednost tipa =T=
   - =&= operator vraća pokazivač na zadati argument/vrednost

      #+BEGIN_SRC go
      i := 42
      p = &i  // p je pokazivač na vrednost 42
      #+END_SRC
   
   - =*= operator označava vrednost na koju pokazivač pokazuje

      #+BEGIN_SRC go
      fmt.Println(*p) // čitanje i vrednosti kroz pokazivač p
      *p = 21         // postavljanje i vrednosti kroz pokazivač p
      #+END_SRC
      
     - Ovo se još naziva i /dereferenciranje/ ili /indirekcija/
     - Za razliku od jezika C, Go nema pokazivačku aritmetiku

   #+REVEAL: split
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      i, j := 42, 2701

      p := &i         // point to i
      fmt.Println(*p) // read i through the pointer
      *p = 21         // set i through the pointer
      fmt.Println(i)  // see the new value of i

      p = &j         // point to j
      *p = *p / 37   // divide j through the pointer
      fmt.Println(j) // see the new value of j
    }
   #+END_SRC
   
