courses/tech/GoLang/index.html
<section id="slide-orge8fa3bb">
<h3 id="orge8fa3bb"><code>For</code> iskaz</h3>
<ul>
<li>Go ima samo jedan iskaz za petlje &#x2013; <code>for</code></li>
<li>Tri komponente:
<ul>
<li><i>init iskaz</i> &#x2013; izvršava se pre prve iteracije</li>
<li><i>uslov</i> &#x2013; evaluira se pre svake iteracije i u zavisnosti od rezultata
ciklus se izvršava ili se petlja prekida</li>
<li><i>post iskaz</i> &#x2013; izvršava se na kraju svake iteracije</li>

</ul></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  sum := 0
  for i := 0; i &lt; 10; i++ {
    sum += i
  }
  fmt.Println(sum)
}
</code></pre>
</div>

<ul>
<li>Zagrade <code>()</code> se ne navode kao u nekim drugim jezicima ali je navođenje <code>{}</code>
za telo petlje obavezno</li>
<li>Varijable kreirane u <i>init</i> iskazu su dostupne samo unutar petlje</li>

</ul>

</section>
<section>

<ul>
<li><i>init</i> i <i>post</i> iskazi su opcioni</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  sum := 1
  for ; sum &lt; 1000; {
    sum += sum
  }
  fmt.Println(sum)
}
</code></pre>
</div>

</section>
<section id="slide-org3cb02fc">
<h3 id="org3cb02fc"><code>for</code> je <code>while</code> u Go-u</h3>
<ul>
<li>Kada nemamo <i>init</i> i <i>post</i> iskaz možemo izostaviti <code>;</code> i dobijamo
ekvivalent <code>while</code> petlje u drugim jezicima</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  sum := 1
  for sum &lt; 1000 {
    sum += sum
  }
  fmt.Println(sum)
}
</code></pre>
</div>

</section>
<section id="slide-org955931e">
<h3 id="org955931e">"Beskonačna" petlja</h3>
<ul>
<li>Ako se izostavi i uslov dobijamo beskonačnu petlju</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

func main() {
  for {
  }
}
</code></pre>
</div>

</section>
<section id="slide-org74b3077">
<h3 id="org74b3077">Uslovi &#x2013; <code>if</code> iskaz</h3>
<ul>
<li>Kao i kod <code>for</code> i kod <code>if</code> iskaza zagrade nije potrebno navoditi</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func sqrt(x float64) string {
  if x &lt; 0 {
    return sqrt(-x) + "i"
  }
  return fmt.Sprint(math.Sqrt(x))
}

func main() {
  fmt.Println(sqrt(2), sqrt(-4))
}
</code></pre>
</div>

</section>
<section id="slide-orgcefd55a">
<h3 id="orgcefd55a"><code>if</code> sa kratkim iskazom</h3>
<ul>
<li>Kao i <code>for</code> i <code>if</code> može da ima kratak iskaz (najčešće <code>:=</code>) koji se
izvršava pre uslova</li>
<li>Varijable deklarisane u ovom iskazu su dostupne samo unutar <code>if</code> iskaza</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func pow(x, n, lim float64) float64 {
  if v := math.Pow(x, n); v &lt; lim {
    return v
  }
  return lim
}

func main() {
  fmt.Println(
    pow(3, 2, 10),
    pow(3, 3, 20),
  )
}
</code></pre>
</div>

</section>
<section id="slide-org5747d99">
<h3 id="org5747d99"><code>if</code> i <code>else</code></h3>
<ul>
<li>Varijable deklarisane u <code>if</code> kratkom iskazu su dostupne i u opcionom <code>else</code>
bloku</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func pow(x, n, lim float64) float64 {
  if v := math.Pow(x, n); v &lt; lim {
    return v
  } else {
    fmt.Printf("%g &gt;= %g\n", v, lim)
  }
  // can't use v here, though
  return lim
}

func main() {
  fmt.Println(
    pow(3, 2, 10),
    pow(3, 3, 20),
  )
}
</code></pre>
</div>

<pre  class="example">
27 &gt;= 20
9 20
</pre>

</section>
<section id="slide-org08520ef">
<h3 id="org08520ef"><code>switch</code> iskaz</h3>
<ul>
<li>Kraći način pisanja sekvence <code>if/else</code> iskaza. Izvršava prvi <code>case</code> blok
gde je vrednost jednaka vrednošću izraza uslova</li>
<li>Može imati kratak iskaz kao i <code>if</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "runtime"
)

func main() {
  fmt.Print("Go runs on ")
  switch os := runtime.GOOS; os {
  case "darwin":
    fmt.Println("OS X.")
  case "linux":
    fmt.Println("Linux.")
  default:
    // freebsd, openbsd,
    // plan9, windows...
    fmt.Printf("%s.\n", os)
  }
}
</code></pre>
</div>

<ul>
<li>Za razliku od drugih jezika izvršava se samo jedan <code>case</code> blok (nema
"propadanja"). Takođe <code>case</code> prihvata izraz koji ne mora biti konstanta i
čija vrenost ne mora biti numerička</li>

</ul>

</section>
<section id="slide-org8a96811">
<h3 id="org8a96811">Evaluacija <code>switch</code> iskaza</h3>
<ul>
<li>Evaluacija <code>case</code> blokova ide od vrha prema dnu dok se ne nađe prvi blok
čija vrednost je jednaka zadatom uslovu</li>

<li><code>f()</code> se ne poziva ako je <code>i==0</code></li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >switch i {
case 0:
case f():
}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "time"
)

func main() {
  fmt.Println("When's Saturday?")
  today := time.Now().Weekday()
  switch time.Saturday {
  case today + 0:
    fmt.Println("Today.")
  case today + 1:
    fmt.Println("Tomorrow.")
  case today + 2:
    fmt.Println("In two days.")
  default:
    fmt.Println("Too far away.")
  }
}
</code></pre>
</div>

</section>
<section id="slide-org1866e53">
<h3 id="org1866e53"><code>switch</code> bez uslova</h3>
<ul>
<li>Ekvivalentno sa <code>switch true</code></li>
<li>Ćistiji način pisanja dugih if-then-else lanaca</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "time"
)

func main() {
  t := time.Now()
  switch {
  case t.Hour() &lt; 12:
    fmt.Println("Good morning!")
  case t.Hour() &lt; 17:
    fmt.Println("Good afternoon.")
  default:
    fmt.Println("Good evening.")
  }
}
</code></pre>
</div>

</section>
<section id="slide-orgd1a404d">
<h3 id="orgd1a404d"><code>defer</code> iskaz</h3>
<ul>
<li>Odlaže izvršavanje funkcije dok se ne vratimo iz funkcije u kojoj se
nalazimo</li>
<li>Parametri funkcije se evaluiraju na mestu poziva <code>defer</code> ali se ciljna
funkcija ne poziva do povratka</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  defer fmt.Println("world")

  fmt.Println("hello")
}
</code></pre>
</div>

<pre  class="example">
hello
world
</pre>

</section>
<section id="slide-org4990b1b">
<h3 id="org4990b1b">Stekovanje <code>defer</code> poziva</h3>
<ul>
<li><code>defer</code> pozivi se smeštaju na stek i po povratku funcije se izvršavaju u
LIFO redosledu</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  fmt.Println("counting")

  for i := 0; i &lt; 10; i++ {
    defer fmt.Println(i)
  }

  fmt.Println("done")
}
</code></pre>
</div>

<pre  class="example">
counting
done
9
8
...
</pre>

<ul>
<li>Više detalja možete naći u <a href="https://blog.golang.org/defer-panic-and-recover">ovom blog post-u</a></li>

</ul>

</section>
</section>
<section>
<section id="slide-org0af3ed7">
<h2 id="org0af3ed7"><code>struct</code>, <code>slice</code> i <code>map</code></h2>
<div class="outline-text-2" id="text-org0af3ed7">
</div>
</section>
<section id="slide-orgdd9ceff">
<h3 id="orgdd9ceff">Pokazivači (<code>Pointers</code>)</h3>
<ul>
<li>Memorijska adresa vrednosti varijable</li>
<li><code>*T</code> je pokazivač na vrednost tipa <code>T</code></li>
<li><p>
<code>&amp;</code> operator vraća pokazivač na zadati argument/vrednost
</p>

<div class="org-src-container">

<pre><code class=" go" >i := 42
p = &amp;i  // p je pokazivač na vrednost 42
</code></pre>
</div></li>

<li><p>
<code>*</code> operator označava vrednost na koju pokazivač pokazuje
</p>

<div class="org-src-container">

<pre><code class=" go" >fmt.Println(*p) // čitanje i vrednosti kroz pokazivač p
*p = 21         // postavljanje i vrednosti kroz pokazivač p
</code></pre>
</div>

<ul>
<li>Ovo se još naziva i <i>dereferenciranje</i> ili <i>indirekcija</i></li>
<li>Za razliku od jezika C, Go nema pokazivačku aritmetiku</li>

</ul></li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  i, j := 42, 2701

  p := &amp;i         // point to i
  fmt.Println(*p) // read i through the pointer
  *p = 21         // set i through the pointer
  fmt.Println(i)  // see the new value of i

  p = &amp;j         // point to j
  *p = *p / 37   // divide j through the pointer
  fmt.Println(j) // see the new value of j
}
</code></pre>
</div>

</section>
