courses/tech/GoLang/GoLang.org
** Strukture (=struct=)
   
   - Kolekcija polja

   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      X int
      Y int
    }

    func main() {
      fmt.Println(Vertex{1, 2})
    }
   #+END_SRC
   
   #+REVEAL: split
   
   - Poljima se pristupa upotrebom =.= operatora

   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      X int
      Y int
    }

    func main() {
      v := Vertex{1, 2}
      v.X = 4
      fmt.Println(v.X)
    }
   #+END_SRC

** Pokazivači na strukture
   
   - Poljima strukture se može pristupiti preko pokazivača na strukturu
   - Sintaksno, ako imamo pokazivač =p= na strukturu, polju =X= bi mogli
     pristupiti sa =(*p).X= 
   - Pošto je ovakva sintaksa teža za korišćenje uvedena je prečica =p.X= tj.
     nije potrebno eksplicitno dereferenciranje
     
     #+BEGIN_SRC go
      package main

      import "fmt"

      type Vertex struct {
        X int
        Y int
      }

      func main() {
        v := Vertex{1, 2}
        p := &v
        p.X = 1e9
        fmt.Println(v)
      }
     #+END_SRC

** =struct= literali
   
   - Kreiranje strukture listanjem vrednosti njenih polja
   - Moguće je koristiti sintaksu =Name:= za postavljanje vrednosti polja i u
     tom slučaju redosled je irelevantan
   - Ukoliko se koristi operator =&= vraća se pokazivač na strukturu
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      X, Y int
    }

    var (
      v1 = Vertex{1, 2}  // has type Vertex
      v2 = Vertex{X: 1}  // Y:0 is implicit
      v3 = Vertex{}      // X:0 and Y:0
      p  = &Vertex{1, 2} // has type *Vertex
    )

    func main() {
      fmt.Println(v1, p, v2, v3)
    }
   #+END_SRC

** Nizovi (=Arrays=)
   
   - =[n]T= -- niz od =n= elemenata tipa =T=
   - =var a [10]int= -- niz od 10 elemenata tipa =int=
   - Nizovi su fiksne veličine
 
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      var a [2]string
      a[0] = "Hello"
      a[1] = "World"
      fmt.Println(a[0], a[1])
      fmt.Println(a)

      primes := [6]int{2, 3, 5, 7, 11, 13}
      fmt.Println(primes)
    }
   #+END_SRC

** Isečci (=Slices=)
   
   - Niz je fiksne dužine
   - Isečak je "prozor" na niz koji ima dinamičku veličinu
   - =[]T= -- isečak tipa =T=
   - Isečak se formira iznad niza na sledeći način:
     
     #+BEGIN_SRC go
     a[low : high]
     #+END_SRC
     
   - Ovo formira polu-otvoren interval elemenata uključujući prvi ali
     isključujući poslednji
     
     #+BEGIN_SRC go
      package main

      import "fmt"

      func main() {
        primes := [6]int{2, 3, 5, 7, 11, 13}

        var s []int = primes[1:4]
        fmt.Println(s)
      }
     #+END_SRC

** Isečci kao pokazivači
   
   - Isečci se ponašaju kao pokazivači na nizove ispod njih
   - Izmena elementa kroz isečak menja elemente niza
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      names := [4]string{
        "John",
        "Paul",
        "George",
        "Ringo",
      }
      fmt.Println(names)

      a := names[0:2]
      b := names[1:3]
      fmt.Println(a, b)

      b[0] = "XXX"
      fmt.Println(a, b)
      fmt.Println(names)
    }
   #+END_SRC
   
   #+BEGIN_SRC
    [John Paul George Ringo]
    [John Paul] [Paul George]
    [John XXX] [XXX George]
    [John XXX George Ringo]
   #+END_SRC

** Literali za isečke
   
   #+BEGIN_SRC go
   [3]bool{true, true, false}
   #+END_SRC
   
   #+BEGIN_SRC go
   []bool{true, true, false}
   #+END_SRC
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      q := []int{2, 3, 5, 7, 11, 13}
      fmt.Println(q)

      r := []bool{true, false, true, true, false, true}
      fmt.Println(r)

      s := []struct {
        i int
        b bool
      }{
        {2, true},
        {3, false},
        {5, true},
        {7, true},
        {11, false},
        {13, true},
      }
      fmt.Println(s)
    }
   #+END_SRC

** Podrazumevane granice intervala
   
   - Kada se kreira isečak niza moguće je izostaviti bilo koju granicu.
   - Podrazumevana donja granica je =0=
   - Podrazumevana gornja granica je dužina niza
   - Ekvivalentni izrazi:

     #+BEGIN_SRC go
      a[0:10]
      a[:10]
      a[0:]
      a[:]
     #+END_SRC
     
   #+REVEAL: split
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      s := []int{2, 3, 5, 7, 11, 13}

      s = s[1:4]
      fmt.Println(s)

      s = s[:2]
      fmt.Println(s)

      s = s[1:]
      fmt.Println(s)
    }
   #+END_SRC
   
   #+BEGIN_SRC
    [3 5 7]
    [3 5]
    [5]
   #+END_SRC

** Dužina i kapacitet isečka
   
   - Isečak ima /dužinu/ i /kapacitet/
   - Dužina je broj elemenata isečka. Kapacitet je broj elemenata počevši od
     prvog elementa isečka do poslednjeg elementa potpornog niza.
   - dužina i kapacitet isečka =s=: =len(s)=, =cap(s)=
   - Dužina isečka se može povećati ponovnim isecanjem (/reslicing/) u skladu sa
     kapacitetom
    
   #+REVEAL: split
     
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      s := []int{2, 3, 5, 7, 11, 13}
      printSlice(s)

      // Slice the slice to give it zero length.
      s = s[:0]
      printSlice(s)

      // Extend its length.
      s = s[:4]
      printSlice(s)

      // Drop its first two values.
      s = s[2:]
      printSlice(s)
    }

    func printSlice(s []int) {
      fmt.Printf("len=%d cap=%d %v\n", len(s), cap(s), s)
    }
   #+END_SRC
   
   #+BEGIN_SRC
    len=6 cap=6 [2 3 5 7 11 13]
    len=0 cap=6 []
    len=4 cap=6 [2 3 5 7]
    len=2 cap=4 [5 7]
   #+END_SRC

   
** Prazni (/nil/) isečci
   
   - /Nula/ vrednost za isečak je =nil=
   - Ovakav isečak ima dužinu i kapacitet =0= i nema potporni niz
 
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      var s []int
      fmt.Println(s, len(s), cap(s))
      if s == nil {
        fmt.Println("nil!")
      }
    }
   #+END_SRC
   
   #+BEGIN_SRC
    [] 0 0
    nil!
   #+END_SRC

** Kreiranje isečaka sa =make=
   
   - =make= funkcija alocira niz sa nultim vrednostima i vraća njegov isečak
     
     #+BEGIN_SRC go
     a := make([]int, 5)  // len(a)=5
     #+END_SRC
     
   - moguće je definisati i kapacitet

     #+BEGIN_SRC go
        b := make([]int, 0, 5) // len(b)=0, cap(b)=5

       b = b[:cap(b)] // len(b)=5, cap(b)=5
       b = b[1:]      // len(b)=4, cap(b)=4
     #+END_SRC
     
   #+REVEAL: split
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      a := make([]int, 5)
      printSlice("a", a)

      b := make([]int, 0, 5)
      printSlice("b", b)

      c := b[:2]
      printSlice("c", c)

      d := c[2:5]
      printSlice("d", d)
    }

    func printSlice(s string, x []int) {
      fmt.Printf("%s len=%d cap=%d %v\n",
        s, len(x), cap(x), x)
    }
   #+END_SRC
   
   #+BEGIN_SRC
    a len=5 cap=5 [0 0 0 0 0]
    b len=0 cap=5 []
    c len=2 cap=5 [0 0]
    d len=3 cap=3 [0 0 0]
   #+END_SRC

