courses/tech/GoLang/index.html
<section id="slide-org0735095">
<h3 id="org0735095">Strukture (<code>struct</code>)</h3>
<ul>
<li>Kolekcija polja</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  X int
  Y int
}

func main() {
  fmt.Println(Vertex{1, 2})
}
</code></pre>
</div>

</section>
<section>

<ul>
<li>Poljima se pristupa upotrebom <code>.</code> operatora</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  X int
  Y int
}

func main() {
  v := Vertex{1, 2}
  v.X = 4
  fmt.Println(v.X)
}
</code></pre>
</div>

</section>
<section id="slide-org769601b">
<h3 id="org769601b">Pokazivači na strukture</h3>
<ul>
<li>Poljima strukture se može pristupiti preko pokazivača na strukturu</li>
<li>Sintaksno, ako imamo pokazivač <code>p</code> na strukturu, polju <code>X</code> bi mogli
pristupiti sa <code>(*p).X</code></li>
<li><p>
Pošto je ovakva sintaksa teža za korišćenje uvedena je prečica <code>p.X</code> tj.
nije potrebno eksplicitno dereferenciranje
</p>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  X int
  Y int
}

func main() {
  v := Vertex{1, 2}
  p := &amp;v
  p.X = 1e9
  fmt.Println(v)
}
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-orgd8ae4cd">
<h3 id="orgd8ae4cd"><code>struct</code> literali</h3>
<ul>
<li>Kreiranje strukture listanjem vrednosti njenih polja</li>
<li>Moguće je koristiti sintaksu <code>Name:</code> za postavljanje vrednosti polja i u
tom slučaju redosled je irelevantan</li>
<li>Ukoliko se koristi operator <code>&amp;</code> vraća se pokazivač na strukturu</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  X, Y int
}

var (
  v1 = Vertex{1, 2}  // has type Vertex
  v2 = Vertex{X: 1}  // Y:0 is implicit
  v3 = Vertex{}      // X:0 and Y:0
  p  = &amp;Vertex{1, 2} // has type *Vertex
)

func main() {
  fmt.Println(v1, p, v2, v3)
}
</code></pre>
</div>

</section>
<section id="slide-org6de47d4">
<h3 id="org6de47d4">Nizovi (<code>Arrays</code>)</h3>
<ul>
<li><code>[n]T</code> &#x2013; niz od <code>n</code> elemenata tipa <code>T</code></li>
<li><code>var a [10]int</code> &#x2013; niz od 10 elemenata tipa <code>int</code></li>
<li>Nizovi su fiksne veličine</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  var a [2]string
  a[0] = "Hello"
  a[1] = "World"
  fmt.Println(a[0], a[1])
  fmt.Println(a)

  primes := [6]int{2, 3, 5, 7, 11, 13}
  fmt.Println(primes)
}
</code></pre>
</div>

</section>
<section id="slide-orga1f7abe">
<h3 id="orga1f7abe">Isečci (<code>Slices</code>)</h3>
<ul>
<li>Niz je fiksne dužine</li>
<li>Isečak je "prozor" na niz koji ima dinamičku veličinu</li>
<li><code>[]T</code> &#x2013; isečak tipa <code>T</code></li>
<li><p>
Isečak se formira iznad niza na sledeći način:
</p>

<div class="org-src-container">

<pre><code class=" go" >a[low : high]
</code></pre>
</div></li>

<li><p>
Ovo formira polu-otvoren interval elemenata uključujući prvi ali
isključujući poslednji
</p>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  primes := [6]int{2, 3, 5, 7, 11, 13}

  var s []int = primes[1:4]
  fmt.Println(s)
}
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-orgf97294d">
<h3 id="orgf97294d">Isečci kao pokazivači</h3>
<ul>
<li>Isečci se ponašaju kao pokazivači na nizove ispod njih</li>
<li>Izmena elementa kroz isečak menja elemente niza</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  names := [4]string{
    "John",
    "Paul",
    "George",
    "Ringo",
  }
  fmt.Println(names)

  a := names[0:2]
  b := names[1:3]
  fmt.Println(a, b)

  b[0] = "XXX"
  fmt.Println(a, b)
  fmt.Println(names)
}
</code></pre>
</div>

<pre  class="example">
[John Paul George Ringo]
[John Paul] [Paul George]
[John XXX] [XXX George]
[John XXX George Ringo]
</pre>

</section>
<section id="slide-org7cb9f40">
<h3 id="org7cb9f40">Literali za isečke</h3>
<div class="org-src-container">

<pre><code class=" go" >[3]bool{true, true, false}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" go" >[]bool{true, true, false}
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  q := []int{2, 3, 5, 7, 11, 13}
  fmt.Println(q)

  r := []bool{true, false, true, true, false, true}
  fmt.Println(r)

  s := []struct {
    i int
    b bool
  }{
    {2, true},
    {3, false},
    {5, true},
    {7, true},
    {11, false},
    {13, true},
  }
  fmt.Println(s)
}
</code></pre>
</div>

</section>
<section id="slide-orgb794b86">
<h3 id="orgb794b86">Podrazumevane granice intervala</h3>
<ul>
<li>Kada se kreira isečak niza moguće je izostaviti bilo koju granicu.</li>
<li>Podrazumevana donja granica je <code>0</code></li>
<li>Podrazumevana gornja granica je dužina niza</li>
<li><p>
Ekvivalentni izrazi:
</p>

<div class="org-src-container">

<pre><code class=" go" >a[0:10]
a[:10]
a[0:]
a[:]
</code></pre>
</div></li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  s := []int{2, 3, 5, 7, 11, 13}

  s = s[1:4]
  fmt.Println(s)

  s = s[:2]
  fmt.Println(s)

  s = s[1:]
  fmt.Println(s)
}
</code></pre>
</div>

<pre  class="example">
[3 5 7]
[3 5]
[5]
</pre>

</section>
<section id="slide-org495f8dd">
<h3 id="org495f8dd">Dužina i kapacitet isečka</h3>
<ul>
<li>Isečak ima <i>dužinu</i> i <i>kapacitet</i></li>
<li>Dužina je broj elemenata isečka. Kapacitet je broj elemenata počevši od
prvog elementa isečka do poslednjeg elementa potpornog niza.</li>
<li>dužina i kapacitet isečka <code>s</code>: <code>len(s)</code>, <code>cap(s)</code></li>
<li>Dužina isečka se može povećati ponovnim isecanjem (<i>reslicing</i>) u skladu sa
kapacitetom</li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  s := []int{2, 3, 5, 7, 11, 13}
  printSlice(s)

  // Slice the slice to give it zero length.
  s = s[:0]
  printSlice(s)

  // Extend its length.
  s = s[:4]
  printSlice(s)

  // Drop its first two values.
  s = s[2:]
  printSlice(s)
}

func printSlice(s []int) {
  fmt.Printf("len=%d cap=%d %v\n", len(s), cap(s), s)
}
</code></pre>
</div>

<pre  class="example">
len=6 cap=6 [2 3 5 7 11 13]
len=0 cap=6 []
len=4 cap=6 [2 3 5 7]
len=2 cap=4 [5 7]
</pre>


</section>
<section id="slide-org2c3b6ee">
<h3 id="org2c3b6ee">Prazni (<i>nil</i>) isečci</h3>
<ul>
<li><i>Nula</i> vrednost za isečak je <code>nil</code></li>
<li>Ovakav isečak ima dužinu i kapacitet <code>0</code> i nema potporni niz</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  var s []int
  fmt.Println(s, len(s), cap(s))
  if s == nil {
    fmt.Println("nil!")
  }
}
</code></pre>
</div>

<pre  class="example">
[] 0 0
nil!
</pre>

</section>
<section id="slide-orga14e89a">
<h3 id="orga14e89a">Kreiranje isečaka sa <code>make</code></h3>
<ul>
<li><p>
<code>make</code> funkcija alocira niz sa nultim vrednostima i vraća njegov isečak
</p>

<div class="org-src-container">

<pre><code class=" go" >a := make([]int, 5)  // len(a)=5
</code></pre>
</div></li>

<li><p>
moguće je definisati i kapacitet
</p>

<div class="org-src-container">

<pre><code class=" go" > b := make([]int, 0, 5) // len(b)=0, cap(b)=5

b = b[:cap(b)] // len(b)=5, cap(b)=5
b = b[1:]      // len(b)=4, cap(b)=4
</code></pre>
</div></li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  a := make([]int, 5)
  printSlice("a", a)

  b := make([]int, 0, 5)
  printSlice("b", b)

  c := b[:2]
  printSlice("c", c)

  d := c[2:5]
  printSlice("d", d)
}

func printSlice(s string, x []int) {
  fmt.Printf("%s len=%d cap=%d %v\n",
    s, len(x), cap(x), x)
}
</code></pre>
</div>

<pre  class="example">
a len=5 cap=5 [0 0 0 0 0]
b len=0 cap=5 []
c len=2 cap=5 [0 0]
d len=3 cap=3 [0 0 0]
</pre>

</section>
