courses/tech/GoLang/GoLang.org
** Isečak isečaka
   
   - Isečak može da sadrži bilo koji tip, uključujući i druge isečke
 
   #+BEGIN_SRC go
    package main

    import (
      "fmt"
      "strings"
    )

    func main() {
      // Create a tic-tac-toe board.
      board := [][]string{
        []string{"_", "_", "_"},
        []string{"_", "_", "_"},
        []string{"_", "_", "_"},
      }

      // The players take turns.
      board[0][0] = "X"
      board[2][2] = "O"
      board[1][2] = "X"
      board[1][0] = "O"
      board[0][2] = "X"

      for i := 0; i < len(board); i++ {
        fmt.Printf("%s\n", strings.Join(board[i], " "))
      }
    }
   #+END_SRC

** Dodavanje na isečak
   
   #+BEGIN_SRC go
    func append(s []T, vs ...T) []T
   #+END_SRC
   
   - Prvi parametar je isečak, ostali su vrednosti koje se dodaju
   - Povratna vrednost je novi isečak koji sadrži nove elemente
   - Ako potporni niz nema dovoljan kapacitet alocira se novi
   
   #+REVEAL: split
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      var s []int
      printSlice(s)

      // append works on nil slices.
      s = append(s, 0)
      printSlice(s)

      // The slice grows as needed.
      s = append(s, 1)
      printSlice(s)

      // We can add more than one element at a time.
      s = append(s, 2, 3, 4)
      printSlice(s)
    }

    func printSlice(s []int) {
      fmt.Printf("len=%d cap=%d %v\n", len(s), cap(s), s)
    }
   #+END_SRC
   
   #+BEGIN_SRC
    len=0 cap=0 []
    len=1 cap=1 [0]
    len=2 cap=2 [0 1]
    len=5 cap=6 [0 1 2 3 4]
   #+END_SRC

** =range=
   
   - =range= forma =for= petlje iterira kroz elemente isečaka ili mape
 
   #+BEGIN_SRC go
    package main

    import "fmt"

    var pow = []int{1, 2, 4, 8, 16, 32, 64, 128}

    func main() {
      for i, v := range pow {
        fmt.Printf("2**%d = %d\n", i, v)
      }
    }
   #+END_SRC
   
   #+REVEAL: split
   
   - Ukoliko ne koristite indeks pri iteraciji moguće ga je ignorisati
     upotrebom specijalnog imena =_=
     
     #+BEGIN_SRC go
      for i, _ := range pow
      for _, value := range pow
     #+END_SRC
     
   - Ako vam treba samo indeks možete izostaviti drugu varijablu:

     #+BEGIN_SRC go
      for i := range pow
     #+END_SRC
     
     #+BEGIN_SRC go
      package main

      import "fmt"

      func main() {
        pow := make([]int, 10)
        for i := range pow {
          pow[i] = 1 << uint(i) // == 2**i
        }
        for _, value := range pow {
          fmt.Printf("%d\n", value)
        }
      }
     #+END_SRC
     
** Mape
   
   - Mapiranje ključeva na vrednosti -- asocijativni niz
   - Nula vrednost je =nil=
   - =nil= mapa nema ključeve niti se ključevi mogu dodati
   - =make= funkcija vraća inicijalizovanu mapu spremnu za upotrebu
 
   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      Lat, Long float64
    }

    var m map[string]Vertex

    func main() {
      m = make(map[string]Vertex)
      m["Bell Labs"] = Vertex{
        40.68433, -74.39967,
      }
      fmt.Println(m["Bell Labs"])
    }
   #+END_SRC

** Literali za mape
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      Lat, Long float64
    }

    var m = map[string]Vertex{
      "Bell Labs": Vertex{
        40.68433, -74.39967,
      },
      "Google": Vertex{
        37.42202, -122.08408,
      },
    }

    func main() {
      fmt.Println(m)
    }
   #+END_SRC
   
   #+REVEAL: split
   
   - Ime tipa literala se može izostaviti:

   #+BEGIN_SRC go
    package main

    import "fmt"

    type Vertex struct {
      Lat, Long float64
    }

    var m = map[string]Vertex{
      "Bell Labs": {40.68433, -74.39967},
      "Google":    {37.42202, -122.08408},
    }

    func main() {
      fmt.Println(m)
    }
   #+END_SRC
   
** Izmena vrednosti mapa

   - postavljanje vrednosti
   #+BEGIN_SRC go
    m[key] = elem
   #+END_SRC
   
   - čitanje vrednosti
   #+BEGIN_SRC go
    elem = m[key]
   #+END_SRC
   
   - brisanje
   #+BEGIN_SRC go
    delete(m, key)
   #+END_SRC
   
   - čitanje i provera da li element postoji
   #+BEGIN_SRC go
     elem, ok = m[key]
   #+END_SRC
   Ako element postoji =ok= će imati vrednost =true= inače =false=
   
   #+REVEAL: split
   
   #+BEGIN_SRC go
    package main

    import "fmt"

    func main() {
      m := make(map[string]int)

      m["Answer"] = 42
      fmt.Println("The value:", m["Answer"])

      m["Answer"] = 48
      fmt.Println("The value:", m["Answer"])

      delete(m, "Answer")
      fmt.Println("The value:", m["Answer"])

      v, ok := m["Answer"]
      fmt.Println("The value:", v, "Present?", ok)
    }
   #+END_SRC
   
** Funkcije kao vrednosti
   
   - Funkcije se u Go-u vrednosti takođe.
   - Mogu se čuvati kao varijable, prosleđivati kao parametri funkcije ili
     dobijati nazad kao povratne vrednosti
     
   #+BEGIN_SRC go
    package main

    import (
      "fmt"
      "math"
    )

    func compute(fn func(float64, float64) float64) float64 {
      return fn(3, 4)
    }

    func main() {
      hypot := func(x, y float64) float64 {
        return math.Sqrt(x*x + y*y)
      }
      fmt.Println(hypot(5, 12))

      fmt.Println(compute(hypot))
      fmt.Println(compute(math.Pow))
    }
   #+END_SRC
   
   #+BEGIN_SRC
    13
    5
    81
   #+END_SRC

** Zatvorenja (/Closures/)
   
   - Go funkcije mogu biti /zatvorenja/ u smislu da funkcija može da referencira
     vrednosti koje se nalaze izvan nje na mestu njenog kreiranja čak i kada se
     pozove sa drugog mesta. Kažemo da su referencirane vrednosti "vezane" za
     funkciju (/bounded/)
     
   #+BEGIN_SRC go
    package main

    import "fmt"

    func adder() func(int) int {
      sum := 0
      return func(x int) int {
        sum += x
        return sum
      }
    }

    func main() {
      pos, neg := adder(), adder()
      for i := 0; i < 10; i++ {
        fmt.Println(
          pos(i),
          neg(-2*i),
        )
      }
    }
   #+END_SRC

* TODO Metode i interfejsi
** Metode i interfejsi
   
   - Go nema klase ali se mogu definisati metode nad tipovima
   - Metoda je funkcija koja ima specijalni /receiver/ parametar
   #+BEGIN_SRC go
    package main

    import "fmt"

    func adder() func(int) int {
      sum := 0
      return func(x int) int {
        sum += x
        return sum
      }
    }

    func main() {
      pos, neg := adder(), adder()
      for i := 0; i < 10; i++ {
        fmt.Println(
          pos(i),
          neg(-2*i),
        )
      }
    }
   #+END_SRC
   
** Metode su funkcije
   
   - Metode se u osnovi ponašaju kao obične funkcije
   
   #+BEGIN_SRC go
    package main

    import (
      "fmt"
      "math"
    )

    type Vertex struct {
      X, Y float64
    }

    func Abs(v Vertex) float64 {
      return math.Sqrt(v.X*v.X + v.Y*v.Y)
    }

    func main() {
      v := Vertex{3, 4}
      fmt.Println(Abs(v))
    }
   #+END_SRC
   
   #+REVEAL: split
   
   - Metode se ne moraju definisati samo nad strukturama. Na primer:
   
   #+BEGIN_SRC go
    package main

    import (
      "fmt"
      "math"
    )

    type MyFloat float64

    func (f MyFloat) Abs() float64 {
      if f < 0 {
        return float64(-f)
      }
      return float64(f)
    }

    func main() {
      f := MyFloat(-math.Sqrt2)
      fmt.Println(f.Abs())
    }
   #+END_SRC
   
