courses/tech/GoLang/index.html
<section id="slide-org23fd423">
<h3 id="org23fd423">Isečak isečaka</h3>
<ul>
<li>Isečak može da sadrži bilo koji tip, uključujući i druge isečke</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "strings"
)

func main() {
  // Create a tic-tac-toe board.
  board := [][]string{
    []string{"_", "_", "_"},
    []string{"_", "_", "_"},
    []string{"_", "_", "_"},
  }

  // The players take turns.
  board[0][0] = "X"
  board[2][2] = "O"
  board[1][2] = "X"
  board[1][0] = "O"
  board[0][2] = "X"

  for i := 0; i &lt; len(board); i++ {
    fmt.Printf("%s\n", strings.Join(board[i], " "))
  }
}
</code></pre>
</div>

</section>
<section id="slide-org8bae869">
<h3 id="org8bae869">Dodavanje na isečak</h3>
<div class="org-src-container">

<pre><code class=" go" >func append(s []T, vs ...T) []T
</code></pre>
</div>

<ul>
<li>Prvi parametar je isečak, ostali su vrednosti koje se dodaju</li>
<li>Povratna vrednost je novi isečak koji sadrži nove elemente</li>
<li>Ako potporni niz nema dovoljan kapacitet alocira se novi</li>

</ul>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  var s []int
  printSlice(s)

  // append works on nil slices.
  s = append(s, 0)
  printSlice(s)

  // The slice grows as needed.
  s = append(s, 1)
  printSlice(s)

  // We can add more than one element at a time.
  s = append(s, 2, 3, 4)
  printSlice(s)
}

func printSlice(s []int) {
  fmt.Printf("len=%d cap=%d %v\n", len(s), cap(s), s)
}
</code></pre>
</div>

<pre  class="example">
len=0 cap=0 []
len=1 cap=1 [0]
len=2 cap=2 [0 1]
len=5 cap=6 [0 1 2 3 4]
</pre>

</section>
<section id="slide-orgddce3af">
<h3 id="orgddce3af"><code>range</code></h3>
<ul>
<li><code>range</code> forma <code>for</code> petlje iterira kroz elemente isečaka ili mape</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

var pow = []int{1, 2, 4, 8, 16, 32, 64, 128}

func main() {
  for i, v := range pow {
    fmt.Printf("2**%d = %d\n", i, v)
  }
}
</code></pre>
</div>

</section>
<section>

<ul>
<li><p>
Ukoliko ne koristite indeks pri iteraciji moguće ga je ignorisati
upotrebom specijalnog imena <code>_</code>
</p>

<div class="org-src-container">

<pre><code class=" go" >for i, _ := range pow
for _, value := range pow
</code></pre>
</div></li>

<li><p>
Ako vam treba samo indeks možete izostaviti drugu varijablu:
</p>

<div class="org-src-container">

<pre><code class=" go" >for i := range pow
</code></pre>
</div>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  pow := make([]int, 10)
  for i := range pow {
    pow[i] = 1 &lt;&lt; uint(i) // == 2**i
  }
  for _, value := range pow {
    fmt.Printf("%d\n", value)
  }
}
</code></pre>
</div></li>

</ul>

</section>
<section id="slide-orgd2e87d9">
<h3 id="orgd2e87d9">Mape</h3>
<ul>
<li>Mapiranje ključeva na vrednosti &#x2013; asocijativni niz</li>
<li>Nula vrednost je <code>nil</code></li>
<li><code>nil</code> mapa nema ključeve niti se ključevi mogu dodati</li>
<li><code>make</code> funkcija vraća inicijalizovanu mapu spremnu za upotrebu</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  Lat, Long float64
}

var m map[string]Vertex

func main() {
  m = make(map[string]Vertex)
  m["Bell Labs"] = Vertex{
    40.68433, -74.39967,
  }
  fmt.Println(m["Bell Labs"])
}
</code></pre>
</div>

</section>
<section id="slide-org9505a96">
<h3 id="org9505a96">Literali za mape</h3>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  Lat, Long float64
}

var m = map[string]Vertex{
  "Bell Labs": Vertex{
    40.68433, -74.39967,
  },
  "Google": Vertex{
    37.42202, -122.08408,
  },
}

func main() {
  fmt.Println(m)
}
</code></pre>
</div>

</section>
<section>

<ul>
<li>Ime tipa literala se može izostaviti:</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

type Vertex struct {
  Lat, Long float64
}

var m = map[string]Vertex{
  "Bell Labs": {40.68433, -74.39967},
  "Google":    {37.42202, -122.08408},
}

func main() {
  fmt.Println(m)
}
</code></pre>
</div>

</section>
<section id="slide-orgbb13279">
<h3 id="orgbb13279">Izmena vrednosti mapa</h3>
<ul>
<li>postavljanje vrednosti</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >m[key] = elem
</code></pre>
</div>

<ul>
<li>čitanje vrednosti</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >elem = m[key]
</code></pre>
</div>

<ul>
<li>brisanje</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >delete(m, key)
</code></pre>
</div>

<ul>
<li>čitanje i provera da li element postoji</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >elem, ok = m[key]
</code></pre>
</div>
<p>
Ako element postoji <code>ok</code> će imati vrednost <code>true</code> inače <code>false</code>
</p>

</section>
<section>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func main() {
  m := make(map[string]int)

  m["Answer"] = 42
  fmt.Println("The value:", m["Answer"])

  m["Answer"] = 48
  fmt.Println("The value:", m["Answer"])

  delete(m, "Answer")
  fmt.Println("The value:", m["Answer"])

  v, ok := m["Answer"]
  fmt.Println("The value:", v, "Present?", ok)
}
</code></pre>
</div>

</section>
<section id="slide-org4053065">
<h3 id="org4053065">Funkcije kao vrednosti</h3>
<ul>
<li>Funkcije se u Go-u vrednosti takođe.</li>
<li>Mogu se čuvati kao varijable, prosleđivati kao parametri funkcije ili
dobijati nazad kao povratne vrednosti</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

func compute(fn func(float64, float64) float64) float64 {
  return fn(3, 4)
}

func main() {
  hypot := func(x, y float64) float64 {
    return math.Sqrt(x*x + y*y)
  }
  fmt.Println(hypot(5, 12))

  fmt.Println(compute(hypot))
  fmt.Println(compute(math.Pow))
}
</code></pre>
</div>

<pre  class="example">
13
5
81
</pre>

</section>
<section id="slide-orgddbf45a">
<h3 id="orgddbf45a">Zatvorenja (<i>Closures</i>)</h3>
<ul>
<li>Go funkcije mogu biti <i>zatvorenja</i> u smislu da funkcija može da referencira
vrednosti koje se nalaze izvan nje na mestu njenog kreiranja čak i kada se
pozove sa drugog mesta. Kažemo da su referencirane vrednosti "vezane" za
funkciju (<i>bounded</i>)</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func adder() func(int) int {
  sum := 0
  return func(x int) int {
    sum += x
    return sum
  }
}

func main() {
  pos, neg := adder(), adder()
  for i := 0; i &lt; 10; i++ {
    fmt.Println(
      pos(i),
      neg(-2*i),
    )
  }
}
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgbd0b8d2">
<h2 id="orgbd0b8d2"><span class="todo TODO">TODO</span> Metode i interfejsi</h2>
<div class="outline-text-2" id="text-orgbd0b8d2">
</div>
</section>
<section id="slide-org9bc3faf">
<h3 id="org9bc3faf">Metode i interfejsi</h3>
<ul>
<li>Go nema klase ali se mogu definisati metode nad tipovima</li>
<li>Metoda je funkcija koja ima specijalni <i>receiver</i> parametar</li>

</ul>
<div class="org-src-container">

<pre><code class=" go" >package main

import "fmt"

func adder() func(int) int {
  sum := 0
  return func(x int) int {
    sum += x
    return sum
  }
}

func main() {
  pos, neg := adder(), adder()
  for i := 0; i &lt; 10; i++ {
    fmt.Println(
      pos(i),
      neg(-2*i),
    )
  }
}
</code></pre>
</div>

</section>
<section id="slide-org92d9315">
<h3 id="org92d9315">Metode su funkcije</h3>
<ul>
<li>Metode se u osnovi ponašaju kao obične funkcije</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

type Vertex struct {
  X, Y float64
}

func Abs(v Vertex) float64 {
  return math.Sqrt(v.X*v.X + v.Y*v.Y)
}

func main() {
  v := Vertex{3, 4}
  fmt.Println(Abs(v))
}
</code></pre>
</div>

</section>
<section>

<ul>
<li>Metode se ne moraju definisati samo nad strukturama. Na primer:</li>

</ul>

<div class="org-src-container">

<pre><code class=" go" >package main

import (
  "fmt"
  "math"
)

type MyFloat float64

func (f MyFloat) Abs() float64 {
  if f &lt; 0 {
    return float64(-f)
  }
  return float64(f)
}

func main() {
  f := MyFloat(-math.Sqrt2)
  fmt.Println(f.Abs())
}
</code></pre>
</div>

</section>
</section>
